backend/views/fb-booking-booked/book.php

					$to = $request->get('to');
					$stat = $request->get('stat');

					$status = FbBookingStatus::findOne($model->status);
---
SELECT * FROM `fb_booking_status` WHERE `id`=2