backend/views/fb-booking-booked/book_form.php

SELECT * FROM `users`
---
    <?php $form = ActiveForm::begin(); ?>
        <div class="row">
           <div class="col-sm-8">
    			<?= $form->field($model, 'user_id')->dropDownList(ArrayHelper::map(Users::find()->asArray()->all(), 'id', 'username'),  ['prompt'=>'All Users']); ?>

SELECT * FROM `fb_booking_facility` ORDER BY `name`
---
        </div>
        <div class="row">
            <div class="col-sm-8">
    			<?= $form->field($model, 'facility_id')->dropDownList(ArrayHelper::map(FbBookingFacility::find()->orderBy(['name'=> SORT_ASC])->all(),'id','name'),  ['prompt'=>'All Facility']); ?>

SELECT * FROM `fb_booking_status` ORDER BY `title`
---
        </div>
        <div class="row">
            <div class="col-sm-8">
    			<?= $form->field($model, 'status')->dropDownList(ArrayHelper::map(FbBookingStatus::find()->orderBy(['title'=> SORT_ASC])->all(),'id','title'),  ['prompt'=>'All Status']); ?>