backend/views/fb-booking-booked/index.php

<div class="row">
  <div class="col-xs-3">
    <?php $form = ActiveForm::begin(['action' => Url::to(['/booking/index']), 'method' => 'get']);
		  echo Html::dropDownList('uid', '', ArrayHelper::map(Users::find()->asArray()->all(), 'id', 'username'),['class'=>'form-control','prompt' => 'Select User', 'required' => 'required']);
---
SELECT * FROM `users`

	?>
  </div>
  <div class="col-xs-3">
    <?php echo Html::dropDownList('facid', '', ArrayHelper::map(FbBookingFacility::find()->asArray()->all(), 'id', 'name'),['class'=>'form-control','prompt' => 'Select Facility', 'required' => 'required']);
---
SELECT * FROM `fb_booking_facility`

			[
            'attribute' => 'user_id',
			'value' =>  function($searchModel){
                            $user = Users::findOne($searchModel->user_id);
                            return $user->username;
                        },
			'filter' => Html::activeDropDownList($searchModel, 'user_id', ArrayHelper::map(Users::find()->asArray()->all(), 'id', 'username'),['class'=>'form-control','prompt' => 'Select User']),
---
SELECT * FROM `users` WHERE `id`=1041
SELECT * FROM `users`

			[
            'attribute' => 'facility_id',
			'value' => 'facility0.name',
			'filter' => Html::activeDropDownList($searchModel, 'facility_id', ArrayHelper::map(FbBookingFacility::find()->asArray()->all(), 'id', 'name'),['class'=>'form-control','prompt' => 'Select Facility']),
---
SELECT * FROM `fb_booking_facility`

            [
            'attribute' => 'status',
			'value' => 'status2.title',
			'filter' => Html::activeDropDownList($searchModel, 'status', ArrayHelper::map(FbBookingStatus::find()->asArray()->all(), 'id', 'title'),['class'=>'form-control','prompt' => 'Select Status']),
---
SELECT * FROM `fb_booking_status`