backend/views/fb-booking-booked/today.php

SELECT * FROM `users`
---
                            $user = Users::findOne($searchModel->user_id);
                            return $user->username;
                        },
			'filter' => Html::activeDropDownList($searchModel, 'user_id', ArrayHelper::map(Users::find()->asArray()->all(), 'id', 'username'),['class'=>'form-control','prompt' => 'Select User']),

SELECT * FROM `fb_booking_facility`
---
			[
            'attribute' => 'facility_id',
			'value' => 'facility0.name',
			'filter' => Html::activeDropDownList($searchModel, 'facility_id', ArrayHelper::map(FbBookingFacility::find()->asArray()->all(), 'id', 'name'),['class'=>'form-control','prompt' => 'Select Facility']),