backend/controllers/FbBookingFacilityController.php

    protected function findModel($id)
    {
        if (($model = FbBookingFacility::findOne($id)) !== null) {
---
SELECT * FROM `fb_booking_facility` WHERE `id`='27'