backend/views/fb-barring/index.php

SELECT * FROM `users`
---
                                $user = Users::findOne($searchModel->user_id);
                                return $user->username;
                            },
                'filter' => Html::activeDropDownList($searchModel, 'user_id', ArrayHelper::map(Users::find()->asArray()->all(), 'id', 'username'),['class'=>'form-control','prompt' => 'Select User']),

SELECT * FROM `fb_booking_facility`
---
                        $user = FbBookingFacility::findOne($searchModel->facility_id);
                        return $user->name;
                    },
                    'filter' => Html::activeDropDownList($searchModel, 'facility_id', ArrayHelper::map(FbBookingFacility::find()->asArray()->all(), 'id', 'name'),['class'=>'form-control','prompt' => 'Select Facility']),

SELECT * FROM `fb_booking_group`
---
                            $grp = FbBookingGroup::findOne($searchModel->group_id);
                            return $grp->name;
                        },
                        'filter' => Html::activeDropDownList($searchModel, 'group_id', ArrayHelper::map(FbBookingGroup::find()->asArray()->all(), 'id', 'name'),['class'=>'form-control','prompt' => 'Select Group']),