controllers/FbBookingGroupController.php

    protected function findModel($id)
    {
        if (($model = FbBookingGroup::findOne($id)) !== null) {
---
SELECT * FROM `fb_booking_group` WHERE `id`='40'