backend/views/fb-booking-facility/index.php

			[
            'attribute' => 'group',
			'value' => 'group1.name',
			'filter' => Html::activeDropDownList($searchModel, 'group', ArrayHelper::map(FbBookingGroup::find()->asArray()->all(), 'id', 'name'),['class'=>'form-control','prompt' => 'Select Group']),
---
SELECT * FROM `fb_booking_group`